# JournalingAttribute Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
JournalingAttribute Class
Members See Also
---
The custom journaling attribute to control the journaling behavior of the external command.
**Namespace:** Autodesk.Revit.Attributes**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public class JournalingAttribute : Attribute
```

Visual Basic
---
```text
Public Class JournalingAttribute _
	Inherits Attribute
```

Visual C++
---
```text
public ref class JournalingAttribute : public Attribute
```

# Inheritance Hierarchy
System..::..Object System..::..Attribute Autodesk.Revit.Attributes..::..JournalingAttribute
# See Also
JournalingAttribute Members
Autodesk.Revit.Attributes Namespace